Hainzcn/M0G3519/M0G3519.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0G351X" --package "LQFP-100(PZ)" --part "Default"
//@v2CliArgs --device "MSPM0G3519" --package "LQFP-100(PZ)"
// @cliArgs --board /ti/boards/LP_MSPM0G3519 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");
const UART   = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1  = UART.addInstance();
const UART2  = UART.addInstance();
const UART3  = UART.addInstance();
const UART4  = UART.addInstance();
const I2C    = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1   = I2C.addInstance();

/**
 * Write custom configuration values to the imported modules.
 * MCLK = 80 MHz via SYSOSC (32 MHz) -> SYSPLL CLK2X
 */
const divider5       = system.clockTree["PLL_CLK1_DIV"];
divider5.divideValue = 4;

const divider6       = system.clockTree["PLL_CLK2X_DIV"];
divider6.divideValue = 4;

const divider7       = system.clockTree["PLL_PDIV"];
divider7.divideValue = 2;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 10;

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL2X";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

SYSCTL.MCLKSource            = "HSCLK";
SYSCTL.SYSPLL_CLK1En         = true;
SYSCTL.SYSPLL_CLK2XEn        = true;
SYSCTL.SYSPLL_CLK2XDiv       = 1;
SYSCTL.HSCLKSource           = "SYSPLLCLK2X";
SYSCTL.validateClkStatus     = true;
SYSCTL.SYSPLL_Qdiv           = 5;
SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn           = true;

UART1.$name                    = "UART_0";
UART1.targetBaudRate           = 115200;
UART1.uartClkDiv               = "8";
UART1.peripheral.$assign       = "UART0";
UART1.peripheral.txPin.$assign = "PA10";
UART1.peripheral.rxPin.$assign = "PA11";

UART2.$name                    = "UART_1";
UART2.targetBaudRate           = 115200;
UART2.uartClkDiv               = "8";
UART2.enableFIFO               = true;
UART2.rxFifoThreshold          = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART2.enableDMATX              = false;
UART2.enabledInterrupts        = ["DMA_DONE_RX"];
UART2.enabledDMARXTriggers     = "DL_UART_DMA_INTERRUPT_RX";
UART2.peripheral.$assign       = "UART1";
UART2.peripheral.txPin.$assign = "PA8";
UART2.peripheral.rxPin.$assign = "PA9";
UART2.DMA_CHANNEL_RX.$name              = "DMA_IMU_RX";
UART2.DMA_CHANNEL_RX.addressMode        = "f2b";
UART2.DMA_CHANNEL_RX.dstLength          = "BYTE";
UART2.DMA_CHANNEL_RX.srcLength          = "BYTE";
UART2.DMA_CHANNEL_RX.peripheral.$assign = "DMA_CH0";

UART3.$name                    = "UART_EMM42";
UART3.targetBaudRate           = 115200;
UART3.uartClkDiv               = "8";
UART3.enabledInterrupts        = ["RX"];
UART3.peripheral.$assign       = "UART7";
UART3.peripheral.txPin.$assign = "PA23";
UART3.peripheral.rxPin.$assign = "PA24";

UART4.$name                    = "UART_BLUETOOTH";
UART4.targetBaudRate           = 115200;
UART4.uartClkDiv               = "8";
UART4.enabledInterrupts        = ["RX"];
UART4.peripheral.$assign       = "UART3";
UART4.peripheral.txPin.$assign = "PB12";
UART4.peripheral.rxPin.$assign = "PB13";

I2C1.basicEnableController       = true;
I2C1.basicControllerBusSpeed     = 400000;
I2C1.$name                       = "I2C_OLED";
I2C1.advAnalogGlitchFilter       = "50";
I2C1.peripheral.$assign          = "I2C0";
I2C1.peripheral.sclPin.$assign   = "PB0";
I2C1.peripheral.sdaPin.$assign   = "PB1";
